[
	{
		"ch":"當兵前的作品，主要是負責切板跟使用jquery製作簡單功能，而網頁是RWD(響應式網頁)，並無使用任何框架，切版跟刻樣式是我自己完成。",
		"en":"Site of  VMAGE Co., Ltd , this was 2014 version , I built this site with html5+css+jquery and this was first site i built in RWD."
	},
	{
		"ch":"為企業通訊軟體的產品官網，切板時使用css框架(bootstrap)，另外客戶聯繫表單使用 ajax串接後台api。",
		"en":"Enterprise communications App Product Website,This site was built with css framework(bootstrap) and some animate effect was built by myself. The contact form was use AJAX to submit custom content and connect api."
	},
	{
	  "ch":"百家樂的網頁遊戲，我主要負責版面切版跟前端功能皆開發完成，而遊戲結果運算在後端進行，前端則為發牌動態顯示，以及下注功能的驗證。",
	  "en":"I handle the all front-end part of the game,the mainly part was betting area function and dealing card function."
	},
	{
	  "ch":"這是幫公司寫的心理測驗網頁，主要框架是以bootstrap為主，然後從後台api串接資料顯示在頁面上。",
	  "en":"This is a Mental Test Games,I use bootstrap for layout and the fornt-end data was got from backend api."
	},
	{
	  "ch":"Riche88最新的官網，新官網的規模較大，我主要負責了網頁板跟手機板的前端，另外網頁版除了主頁外，還有使用者的設定頁面跟遊戲頁等共10多頁，所有頁面效果跟一些頁面的驗證功能也都是我獨立開發完成。",
	  "en":"This is New Riche88 website , I responsible for all front-end function and effect, there are pc version and moblie version."
	},
	{
		"ch":"這是我一款用Egret遊戲引擎製作的小遊戲 ，開發語言主要是TypeScript ，玩法則是限時內點擊黑框 ，若點到白框則遊戲結束。",
		"en":"This web Game which i built by Egret game engines, the programming language is TypeScript, the Game rules is don't Touch the White rect In time limit,if you touch the white Rect then Game Over."
	},
	{
		"ch":"這是我用Egret遊戲引擎製作的老虎機，設計上有參考一些市面的老虎機遊戲而素材來源是從免費開源網站(有附上素材來源)，這個作品算是充分運用了egret引擎所提供的各項效果跟工具，包含介面編排的eui系統，資源加載的RES系統，開發動態效果的tween跟movieClip跟粒子系統等",
		"en":"This slot game is built By Egret game engines,This example makes full use of the various functions of this game engine. include:EUI system(Game layout),RES system(Game Resource loading),Tween & movieClip(Game Animation),Particle system..etc,and all the function and architecture is made by myself."
	},
	{
		"ch":"這是我用vue.js為之前公司客戶開發的購物網站並且是RWD設計，會選擇用vue開發主要因為vue好上手的工具 vue-cli可以快速協助建置開發環境，另外搭配vuex來控制資料狀態。",
		"en":"This shopping website was built by vue.js,and the web page is RWD design ,so it look good on all device,we also use vue.js tool vue-cli and vuex to speed development."
	}


]